<?php



// 卡片详情这个界面里，红色圈圈的都是导入卡片时会写入的信息，其他的都是另外生成的。
// 归属客户：就是划拨到了哪个用户手上，显示就是哪个用户名
// 流量、语音、停复：对应的就是卡片状态的开流量、开语音、停机三个按钮显示。
// 运营商状态：已激活/库存期，这里的已激活就是已经实名了的意思，库存期就是没实名或者没实名成功（需要对接移动的API接口能力），跟上面的卡片状态有点像，但是卡片状态是跟移动没关系的，这运营商状态跟移动有关。
// 联系电话：这个需要用户在微信公众号购买套餐的时候留下号码（对接显示在系统后台，方便联系用户）
// CUCC-ICCID：无需开发。
// 沉默时间：可以加入到导入卡片里，每次导入前，写上每个批次的沉默时间，这里的沉默时间是指，卡没激活的情况下可以保留到什么时间，超过那个时间就会无法激活，自动报废。
// 备注：可开发放着，暂时还不知道放什么进去。
return [

    'enum' => [
        // 划拨状态：已划拨/未划拨，是指卡片导入到我们系统中，卡片是在我们开宗源泉名下的，这是未划拨的状态，要划拨出去给到用户，就是已划拨的状态。
        'assign_status' => [
            ['id' => 0, 'value' => '未划拨', 'type' => 'info'],
            ['id' => 1, 'value' => '已划拨', 'type' => 'success'],
        ],
        // 卡片状态：已激活/未激活，已激活就是有激活时间，付过款了，未激活就是没有激活时间，没付款，这里卡片状态是对客户有没有付款而言的，跟移动那边没关系。
        'card_status' => [
            ['id' => 0, 'value' => '未激活', 'type' => 'info'],
            ['id' => 1, 'value' => '已激活', 'type' => 'success'],
        ],
        // 实名状态：已实名/未实名，这里的已实名（需要对接移动的API接口能力），表示用户已经实名成功能用这张卡，未实名表示没实名或者没实名成功。
        'real_name_auth' => [
            ['id' => 0, 'value' => '未实名', 'type' => 'info'],
            ['id' => 1, 'value' => '已实名', 'type' => 'success'],
        ],
        // 激活时间：就是用户支付款的时间（这个要等微信公众号弄好支付功能之后，对接微信公众号的信息才能显示过来）
        // 到期时间：同上，就是用户支付款能使用到什么时候。


        // 运营商：是指跟哪个运营商拿的卡（移动电信联通三者之一）
        'operator' => [
            ['id' => 1, 'value' => '中国移动'],
            ['id' => 2, 'value' => '中国联通'],
            ['id' => 3, 'value' => '中国电信'],
        ],
        // 地区运营商：是指哪个地市拿的卡（例如拿了移动的卡，在广东韶关拿的，编码就可以设置为CMCC-GDSGKZYQ，编码意思是移动-广东韶关开宗源泉，这个可以录成我们自己的编码）
        'region_operator' => [
            ['id' => 1, 'value' => 'CMCC-GDSGKZYQ', 'operator_id' => 1],
            ['id' => 2, 'value' => 'CMCC-GDGZKZYQ', 'operator_id' => 1],
            ['id' => 3, 'value' => 'CUCC-GDSGKZYQ', 'operator_id' => 2],
            ['id' => 4, 'value' => 'CTCC-GDSGKZYQ', 'operator_id' => 3],
        ],
        // 运营商接口文档：是指对应地市拿的卡，做好了一套API能力接口对接完之后的文档。
        'region_operator_api' => [
            ['id' => 1, 'value' => 'API-CMCC-GDSGKZYQ', 'region_operator_id' => 1],
            ['id' => 2, 'value' => 'API-CMCC-GDGZKZYQ', 'region_operator_id' => 2],
            ['id' => 3, 'value' => 'API-CUCC-GDSGKZYQ', 'region_operator_id' => 3],
            ['id' => 4, 'value' => 'API-CTCC-GDSGKZYQ', 'region_operator_id' => 4],
        ],
        // 卡类型：现在只放11位非定向语音卡（后面可能会加放11位定向语音）
        'card_type' => [
            ['id' => 1, 'value' => '11位定向语音卡'],
            ['id' => 2, 'value' => '11位非定向语音卡'],
        ],
        // 应用场景：智能穿戴4G儿童手表/智能穿戴2G儿童手表（2个选项）
        'use_scence' => [
            ['id' => 1, 'value' => '智能穿戴4G儿童手表'],
            ['id' => 2, 'value' => '智能穿戴2G儿童手表'],
        ],
        // 卡规格：双切卡/三切卡（2个选项）
        'card_standard' => [
            ['id' => 1, 'value' => '双切卡'],
            ['id' => 1, 'value' => '三切卡'],
        ],
        // 是否已做上游套餐：（这个按钮可以省略，广东卡都是做了套餐发出来的）
        // 上游套餐：是指卡片在移动系统开了什么套餐，一般默认30分钟+100M，后期会做修改，前期的话可以默认30分钟+100M，后期开辟一个窗口给客服或运营人为修改号码对应的上游套餐即可。
        'package' => [
            ['id' => 1, 'value' => '通话分钟：30分钟，流量：100M']
        ],
        // 卡批次：就是指本次要录的多少个号码为1整批出货给客户的批次号记录（看看能不能搞成自动生成批次号，比如今天出了2个批次，0001、0002，明天会自动变成0003，不需要人为输入批次号）

        // CSV文件：就是出货的对应卡号和ICCID号

        // 套餐类型
        'meal_type' => [
            ['id' => 1, 'value' => '年包'],
            ['id' => 2, 'value' => '半年包'],
            ['id' => 3, 'value' => '季包'],
            ['id' => 4, 'value' => '月包'],
            ['id' => 5, 'value' => '体验包'],
        ],

        // 结算类型
        'settle_type' => [
            ['id' => 1, 'value' => '月结'],
            ['id' => 2, 'value' => '按套餐周期结算'],
        ],

        // 购买限制
        'buy_limit' => [
            ['id' => 1, 'value' => '不限制'],
            ['id' => 2, 'value' => '只能购买一次'],
        ],

        // 代理商类型
        'agent_type' => [
            ['id' => 1, 'value' => '行业客户'],
            ['id' => 2, 'value' => '渠道客户'],
            ['id' => 3, 'value' => '自建渠道'],
            ['id' => 4, 'value' => '花卡代理商'],
        ],

        // 代理商级别
        'agent_level' => [
            ['id' => 1, 'value' => 'A（每周二可提现）'],
            ['id' => 2, 'value' => 'B（每月5/16/17号可提现）'],
            ['id' => 3, 'value' => 'C（每周3/4/5号可提现）'],
            ['id' => 4, 'value' => 'D（每日可提现）'],
        ],

        // 实时分润
        'shareprofit' => [
            ['id' => 1, 'value' => '否'],
            ['id' => 2, 'value' => '实时订单29%分润'],
            ['id' => 3, 'value' => '实时余额分润'],
        ],

        // 结算对象（不可修改）
        'settle_target' => [
            ['id' => 1, 'value' => '上级代理商'],
        ],

        // 性别
        'gender' => [
            ['id' => 1, 'value' => '男'],
            ['id' => 2, 'value' => '女'],
        ],

        // 角色
        'role' => [
            ['id' => 1, 'value' => '超级管理员', 'roleCode' => 'admin'],
            ['id' => 2, 'value' => '代理商管理员', 'roleCode' => 'admin_agent'],
        ],

        // 是否上架
        'is_added' => [
            ['id' => 1, 'value' => '是'],
            ['id' => 2, 'value' => '否'],
        ],

         // 是否推荐
         'recommend' => [
            ['id' => 1, 'value' => '是'],
            ['id' => 2, 'value' => '否'],
        ],

    ]

];
